---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceServerExtensions.GetCADLinkOperations
source: html/b4ed124d-5577-411e-946e-04bd0a3dc522.htm
---
# Autodesk.Revit.DB.ExternalResourceServerExtensions.GetCADLinkOperations Method

Gets the specific methods supported by external resource CAD Links.

## Syntax (C#)
```csharp
public CADLinkOperations GetCADLinkOperations()
```

## Returns
The specific methods supported by external resource CAD Links.